SM_для_EDT/src/Documents/Анкета/Анкета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Анкета</name>
  <registerRecords>InformationRegister.ОтветыНаВопросыАнкет</registerRecords>
  <attributes>
    <name>Опрос</name>
    <type>
      <types>DocumentRef.НазначениеОпросов</types>
    </type>
  </attributes>
  <attributes>
    <name>Респондент</name>
    <type>
      <types>DefinedType.Респондент</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРедактирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактируемыйРаздел</name>
    <type>
      <types>CatalogRef.ВопросыШаблонаАнкеты</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Интервьюер</name>
    <type>
      <types>DefinedType.Интервьюер</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонАнкеты</name>
    <type>
      <types>CatalogRef.ШаблоныАнкет</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАнкетирования</name>
    <type>
      <types>EnumRef.РежимыАнкетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>рарусМероприятиеСУБ</name>
    <comment>rarus zalikh</comment>
    <type>
      <types>DocumentRef.рарусМероприятиеСУБ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыШаблонаАнкеты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементарныйВопрос</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЯчейки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>Characteristic.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ОткрытыйОтвет</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Catalogs/ВопросыШаблонаАнкеты/ВопросыШаблонаАнкеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВопросыШаблонаАнкеты</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ШаблоныАнкет</owners>
  <attributes>
    <name>Формулировка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязательный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВопроса</name>
    <type>
      <types>EnumRef.ТипыВопросовШаблонаАнкеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТабличногоВопроса</name>
    <type>
      <types>EnumRef.ТипыТабличныхВопросов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементарныйВопрос</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительВопрос</name>
    <type>
      <types>CatalogRef.ВопросыШаблонаАнкеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заметки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтображенияПодсказки</name>
    <type>
      <types>EnumRef.СпособыОтображенияПодсказок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставТабличногоВопроса</name>
    <attributes>
      <name>ЭлементарныйВопрос</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредопределенныеОтветы</name>
    <attributes>
      <name>ЭлементарныйВопрос</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>Characteristic.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплексногоВопроса</name>
    <attributes>
      <name>ЭлементарныйВопрос</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Documents/Анкета/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Движения.ОтветыНаВопросыАнкет.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаСостав.Вопрос,
	|	ТаблицаСостав.ЭлементарныйВопрос,
	|	ТаблицаСостав.НомерЯчейки,
	|	ТаблицаСостав.Ответ,
	|	ТаблицаСостав.ОткрытыйОтвет,
	|	ТаблицаСостав.НомерСтроки
	|ПОМЕСТИТЬ Состав
	|ИЗ
	|	&ТаблицаСостав КАК ТаблицаСостав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Состав.Вопрос,
	|	Состав.ЭлементарныйВопрос,
	|	Состав.НомерЯчейки,
	|	Состав.Ответ,
	|	Состав.ОткрытыйОтвет,
	|	ИСТИНА КАК Активность,
	|	&Ссылка КАК Регистратор,
	|	&Ссылка КАК Анкета,
	|	Состав.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Состав КАК Состав";
	
	Запрос.УстановитьПараметр("ТаблицаСостав",Состав);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Движения.ОтветыНаВопросыАнкет.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	КонецЕсли;
	
	Если РежимАнкетирования = Перечисления.РежимыАнкетирования.Интервью Тогда
		Интервьюер = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если РежимАнкетирования = Перечисления.РежимыАнкетирования.Интервью Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Опрос"));
	Иначе
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ШаблонАнкеты"));
	КонецЕсли;
	
	// ++ ilshil 09.07.2021	
	ПроверитьЗаполнениеКомментарияПриОтрицательномОтветеНаВопрос(Отказ);	
	// -- ilshil 09.07.2021

КонецПроцедуры

// ++ ilshil 09.07.2021
Процедура ПроверитьЗаполнениеКомментарияПриОтрицательномОтветеНаВопрос(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СоставАнкеты.Вопрос КАК Вопрос,
	|	СоставАнкеты.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
	|	СоставАнкеты.НомерЯчейки КАК НомерЯчейки,
	|	СоставАнкеты.Ответ КАК Ответ,
	|	СоставАнкеты.ОткрытыйОтвет КАК ОткрытыйОтвет,
	|	СоставАнкеты.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВтСостав
	|ИЗ
	|	&СоставАнкеты КАК СоставАнкеты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтСостав.НомерСтроки КАК НомерСтроки,
	|	ВопросыШаблонаАнкеты.Формулировка КАК Формулировка,
	|	ВопросыШаблонаАнкеты.Ссылка КАК Ссылка
	|ИЗ
	|	ВтСостав КАК ВтСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыОтветовАнкет КАК ВариантыОтветовАнкет
	|		ПО ВтСостав.Ответ = ВариантыОтветовАнкет.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВопросыШаблонаАнкеты КАК ВопросыШаблонаАнкеты
	|		ПО ВтСостав.Вопрос = ВопросыШаблонаАнкеты.Ссылка
	|ГДЕ
	|	ВариантыОтветовАнкет.РеквизитДопУпорядочивания = 2
	|	И ПОДСТРОКА(ВтСостав.ОткрытыйОтвет, 1, 200) = """"";
	
	Запрос.УстановитьПараметр("СоставАнкеты", Состав);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();	
		Пока Выборка.Следующий() Цикл					
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указан комментарий для ответ на вопрос'") + "- "+ СтрЗаменить(Выборка.Ссылка.ПолныйКод(),"/",".") + " " + Выборка.Формулировка);	
			Отказ = Истина;			
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры
// -- ilshil 09.07.2021

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
